{
    "products": [
        {
          "name": {
            "es": "Queso Porozo de El Salvador",
            "en": "Queso Porozo from El Salvador"
          },
          "route_id": "queso_porozo",
          "description": {
            "es": "¡Un pedazo del corazón salvadoreño! Este queso artesanal tiene una textura firme, un sabor ligeramente salado y un aroma que te transporta directamente a la cocina de la abuela.",
            "en": "A slice of Salvadoran heart! This artisanal cheese has a firm texture, a slightly salty flavor, and an aroma that instantly takes you to grandma’s kitchen."
          },
          "origin": {
            "es": "El Salvador",
            "en": "El Salvador"
          },
          "health_benefits": {
            "es": "Rico en proteínas y calcio, ideal para fortalecer huesos y mantenerte lleno de energía durante el día.",
            "en": "Rich in protein and calcium, perfect for strengthening bones and keeping your energy up throughout the day."
          },
          "images": [
            "images/queso_porozo_1.jpg",
            "images/queso_porozo_2.jpg"
          ]
        },
        {
          "name": {
            "es": "Nance (Fruta Tropical)",
            "en": "Nance (Tropical Fruit)"
          },
          "route_id": "nance",
          "description": {
            "es": "¡Una explosión tropical en cada bocado! El nance es una pequeña fruta amarilla con un sabor entre dulce y ácido, único y adictivo.",
            "en": "A tropical explosion in every bite! Nance is a small yellow fruit with a sweet and tangy flavor — unique and addictive."
          },
          "origin": {
            "es": "Centroamérica",
            "en": "Central America"
          },
          "health_benefits": {
            "es": "Fuente natural de vitamina C, antioxidantes y fibra. Ideal para fortalecer el sistema inmunológico y mejorar la digestión.",
            "en": "A natural source of vitamin C, antioxidants, and fiber. Great for boosting immunity and aiding digestion."
          },
          "images": [
            "images/nance_1.jpg",
            "images/nance_2.jpg"
          ]
        },
        {
          "name": {
            "es": "Semilla de Marañón (Fruta Seca Dorada)",
            "en": "Cashew Seed (Golden Roasted Nut)"
          },
          "route_id": "semilla_maranon",
          "description": {
            "es": "¡El snack dorado que todos deberían probar! Estas semillas de marañón tostadas son crujientes, sabrosas y tienen ese toque irresistible que te hace regresar por más.",
            "en": "The golden snack everyone should try! These roasted cashew seeds are crunchy, flavorful, and have that irresistible touch that keeps you coming back."
          },
          "origin": {
            "es": "El Salvador",
            "en": "El Salvador"
          },
          "health_benefits": {
            "es": "Altas en grasas saludables, proteína vegetal y minerales esenciales como el magnesio.",
            "en": "High in healthy fats, plant-based protein, and essential minerals like magnesium."
          },
          "images": [
            "images/marano_seeds_1.jpg",
            "images/marano_seeds_2.jpg"
          ]
        },
        {
          "name": {
            "es": "Granadillas",
            "en": "Granadillas"
          },
          "route_id": "granadillas",
          "description": {
            "es": "¡Dulce, jugosa y mágica por dentro! La granadilla tiene una cáscara anaranjada crujiente y un interior lleno de semillas cubiertas de una pulpa gelatinosa deliciosa.",
            "en": "Sweet, juicy, and magical inside! Granadillas have a crisp orange shell and a jelly-like pulp packed with edible seeds — a tropical treat."
          },
          "origin": {
            "es": "Sudamérica",
            "en": "South America"
          },
          "health_benefits": {
            "es": "Alto contenido de fibra y antioxidantes. Perfecta para la digestión y la salud intestinal.",
            "en": "High in fiber and antioxidants. Excellent for digestion and gut health."
          },
          "images": [
            "images/granadilla_1.jpg",
            "images/granadilla_2.jpg"
          ]
        },
        {
          "name": {
            "es": "Budín de Banana (Hecho a Mano)",
            "en": "Banana Bread (Handmade)"
          },
          "route_id": "budin_banana",
          "description": {
            "es": "¡El sabor casero que derrite el alma! Hecho con bananas maduras, amor y una receta que te hará cerrar los ojos con cada mordida.",
            "en": "That homemade flavor that melts your soul! Made with ripe bananas, love, and a recipe that makes you close your eyes with every bite."
          },
          "origin": {
            "es": "Hecho a mano localmente",
            "en": "Handmade locally"
          },
          "health_benefits": {
            "es": "Fuente natural de potasio y energía. Ideal como snack saludable o desayuno rápido.",
            "en": "A natural source of potassium and energy. Perfect as a healthy snack or quick breakfast."
          },
          "images": [
            "images/budin_banana_1.jpg",
            "images/budin_banana_2.jpg"
          ]
        },
        {
          "name": {
            "es": "Jícama (Fruta Simple)",
            "en": "Jicama (Simple Fruit)"
          },
          "route_id": "jicama",
          "description": {
            "es": "¡La reina de la frescura! Crujiente, ligera y refrescante como una tarde de verano. Perfecta con limón y chile.",
            "en": "The queen of freshness! Crunchy, light, and refreshing like a summer afternoon. Perfect with lime and chili."
          },
          "origin": {
            "es": "México y Centroamérica",
            "en": "Mexico and Central America"
          },
          "health_benefits": {
            "es": "Baja en calorías, alta en fibra y vitamina C. Un snack ideal para quienes buscan sabor sin culpa.",
            "en": "Low in calories, high in fiber and vitamin C. A guilt-free snack that packs flavor and nutrition."
          },
          "images": [
            "images/jicama_1.jpg",
            "images/jicama_2.jpg"
          ]
        }
      ]
      
}